Tekla.Structures.Analysis.AnalysisObject
The AnalysisObject class is an abstract base class for all analysis objects.

Tekla.Structures.Analysis.AnalysisObject._AnalysisModelName
The analysis model name.

Tekla.Structures.Analysis.AnalysisObject._ID
The identifier of the analysis object.

Tekla.Structures.Analysis.AnalysisObject._AnalysisObjectType
The type of the analysis object.

Tekla.Structures.Analysis.AnalysisObject._FatherObjectID
The identifier of the father part.

Tekla.Structures.Analysis.AnalysisObject._FatherObjectType
The type of the father object.

Tekla.Structures.Analysis.AnalysisObject._FatherObject2ID
The identifier of the father part.

Tekla.Structures.Analysis.AnalysisObject._FatherObject2Type
The type of the father object.

Tekla.Structures.Analysis.AnalysisObject.AnalysisModelName
The analysis model name.

Tekla.Structures.Analysis.AnalysisObject.ID
The identifier of the analysis object.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectType
The type of the analysis object.

Tekla.Structures.Analysis.AnalysisObject.FatherObjectID
The identifier of the father part.

Tekla.Structures.Analysis.AnalysisObject.FatherObjectType
The type of the father object.

Tekla.Structures.Analysis.AnalysisObject.FatherObject2ID
The identifier of the father part.

Tekla.Structures.Analysis.AnalysisObject.FatherObject2Type
The type of the father object.

Tekla.Structures.Analysis.AnalysisObject.Select
Selects an analysis object from the database.